using System.Collections;
using System.Collections.Generic;
using UnityEngine;

public class Type : MonoBehaviour
{

    // Start is called before the first frame update
    public enum TypeEnum
    {
        No = 0,
        Normal = 1,
        Fighting = 2,
        Flying = 3,
        Poison = 4,
        Ground = 5,
        Rock = 6,
        Bug = 7,
        Ghost = 8,
        Steel = 9,
        Fire = 10,
        Water = 11,
        Grass = 12,
        Electric = 13,
        Psychic = 14,
        Ice = 15,
        Dragon = 16,
        Dark = 17,
        Fairy = 18,
        IgnoreType = 19,
    }

    //type[行][列] 用行属性攻击列属性时的补正
    public static float[][] TYPE =new float[][]{ new float[] { 1.0f, 1.0f, 1.0f, 1.0f, 1.0f, 1.0f, 1.0f, 1.0f, 1.0f, 1.0f, 1.0f, 1.0f, 1.0f, 1.0f, 1.0f, 1.0f, 1.0f, 1.0f, 1.0f },  //  无0

                                          new float[] { 1.0f, 1.0f, 1.0f, 1.0f, 1.0f, 1.0f, 0.8f, 1.0f, 0.64f, 0.8f, 1.0f, 1.0f, 1.0f, 1.0f, 1.0f, 1.0f, 1.0f, 1.0f, 1.0f },  //  普1
          
                                          new float[] { 1.0f, 1.2f, 1.0f, 0.8f, 0.8f, 1.0f, 1.2f, 0.8f, 0.64f, 1.2f, 1.0f, 1.0f, 1.0f, 1.0f, 0.8f, 1.2f, 1.0f, 1.2f, 0.8f },  //  斗2

                                          new float[] { 1.0f, 1.0f, 1.2f, 1.0f, 1.0f, 1.0f, 0.8f, 1.2f, 1.0f, 0.8f, 1.0f, 1.0f, 1.2f, 0.8f, 1.0f, 1.0f, 1.0f, 1.0f, 1.0f },  //  飞3

                                          new float[] { 1.0f, 1.0f, 1.0f, 1.0f, 0.8f, 0.8f, 0.8f, 1.0f, 0.8f, 0.64f, 1.0f, 1.0f, 1.2f, 1.0f, 1.0f, 1.0f, 1.0f, 1.0f, 1.2f },  //  毒4

                                          new float[] { 1.0f, 1.0f, 1.0f, 0.64f, 1.2f, 1.0f, 1.2f, 0.8f, 1.0f, 1.2f, 1.2f, 1.0f, 0.8f, 1.2f, 1.0f, 1.0f, 1.0f, 1.0f, 1.0f },  //  地5

                                          new float[] { 1.0f, 1.0f, 0.8f, 1.2f, 1.0f, 0.8f, 1.0f, 1.2f, 1.0f, 0.8f, 1.2f, 1.0f, 1.0f, 1.0f, 1.0f, 1.2f, 1.0f, 1.0f, 1.0f },  //  岩6

                                          new float[] { 1.0f, 1.0f, 0.8f, 0.8f, 0.8f, 1.0f, 1.0f, 1.0f, 0.8f, 0.8f, 0.8f, 1.0f, 1.2f, 1.0f, 1.2f, 1.0f, 1.0f, 1.2f, 0.8f },  //  虫7

                                          new float[] { 1.0f, 0.64f, 1.0f, 1.0f, 1.0f, 1.0f, 1.0f, 1.0f, 1.2f, 1.0f, 1.0f, 1.0f, 1.0f, 1.0f, 1.2f, 1.0f, 1.0f, 0.8f, 1.0f },  //  鬼8
     
                                          new float[] { 1.0f, 1.0f, 1.0f, 1.0f, 1.0f, 1.0f, 1.2f, 1.0f, 1.0f, 0.8f, 0.8f, 0.8f, 1.0f, 0.8f, 1.0f, 1.2f, 1.0f, 1.0f, 1.2f },  //  钢9

                                          new float[] { 1.0f, 1.0f, 1.0f, 1.0f, 1.0f, 1.0f, 0.8f, 1.2f, 1.0f, 1.2f, 0.8f, 0.8f, 1.2f, 1.0f, 1.0f, 1.2f, 0.8f, 1.0f, 1.0f },  //  火10

                                          new float[] { 1.0f, 1.0f, 1.0f, 1.0f, 1.0f, 1.2f, 1.2f, 1.0f, 1.0f, 1.0f, 1.2f, 0.8f, 0.8f, 1.0f, 1.0f, 1.0f, 0.8f, 1.0f, 1.0f },  //  水11

                                          new float[] { 1.0f, 1.0f, 1.0f, 0.8f, 0.8f, 1.2f, 1.2f, 0.8f, 1.0f, 0.8f, 0.8f, 1.2f, 0.8f, 1.0f, 1.0f, 1.0f, 0.8f, 1.0f, 1.0f },  //  草12

                                          new float[] { 1.0f, 1.0f, 1.0f, 1.2f, 1.0f, 0.64f, 1.0f, 1.0f, 1.0f, 1.0f, 1.0f, 1.2f, 0.8f, 0.8f, 1.0f, 1.0f, 0.8f, 1.0f, 1.0f },  //  电13
     
                                          new float[] { 1.0f, 1.0f, 1.2f, 1.0f, 1.2f, 1.0f, 1.0f, 1.0f, 1.0f, 0.8f, 1.0f, 1.0f, 1.0f, 1.0f, 0.8f, 1.0f, 1.0f, 0.64f, 1.0f },  //  超14

                                          new float[] { 1.0f, 1.0f, 1.0f, 1.2f, 1.0f, 1.2f, 1.0f, 1.0f, 1.0f, 0.8f, 0.8f, 0.8f, 1.2f, 1.0f, 1.0f, 0.8f, 1.2f, 1.0f, 1.0f },  //  冰15

                                          new float[] { 1.0f, 1.0f, 1.0f, 1.0f, 1.0f, 1.0f, 1.0f, 1.0f, 1.0f, 0.8f, 1.0f, 1.0f, 1.0f, 1.0f, 1.0f, 1.0f, 1.2f, 1.0f, 0.64f },  //  龙16

                                          new float[] { 1.0f, 1.0f, 0.8f, 1.0f, 1.0f, 1.0f, 1.0f, 1.0f, 1.2f, 1.0f, 1.0f, 1.0f, 1.0f, 1.0f, 1.2f, 1.0f, 1.0f, 0.8f, 0.8f },  //  恶17

                                          new float[] { 1.0f, 1.0f, 1.2f, 1.0f, 0.8f, 1.0f, 1.0f, 1.0f, 1.0f, 0.8f, 0.8f, 1.0f, 1.0f, 1.0f, 1.0f, 1.0f, 1.2f, 1.2f, 1.0f },  //  仙18

                                          new float[] { 1.0f, 1.0f, 1.0f, 1.0f, 1.0f, 1.0f, 1.0f, 1.0f, 1.0f, 1.0f, 1.0f, 1.0f, 1.0f, 1.0f, 1.0f, 1.0f, 1.0f, 1.0f, 1.0f }}; //  属性穿透19


    public static Vector4[] TypeColor = {
        new Vector4(0,0,0,0.5882353f),                                    //无  00
        new Vector4(0.7176471f, 0.6901961f, 0.6666667f, 0.5882353f),      //普通01
        new Vector4(0.4433962f, 0.2580442f, 0.08993414f, 0.7803922f),     //格斗02
        new Vector4(0.24644f,0.4380967f,0.735849f,0.5882353f),            //飞行03
        new Vector4(0.5660378f,0.08810966f,0.4045756f,0.5882353f),        //毒  04
        new Vector4(0.764151f,0.6169877f,0.2703364f,0.7058824f),          //地面05
        new Vector4(0.7075472f, 0.5511783f,0.2636614f,0.7372549f ),       //岩石06
        new Vector4(0.7019608f,0.7372549f,0.2705882f,0.5882353f),         //虫  07
        new Vector4(0.2357066f,0.1169455f,0.3396226f,0.627451f ),         //幽灵08
        new Vector4(0.5f,0.5f,0.5f,0.5882353f),                           //钢  09
        new Vector4(1,0.2308041f,0.08962262f,0.6862745f),                 //火  10
        new Vector4(0.2705882f,0.6196079f,0.9803922f,0.5882353f),         //水  11
        new Vector4(0.4823529f,0.7137255f,0.1960784f,0.5882353f),         //草  12
        new Vector4(0.9921569f,0.9372549f,0.1529412f,0.5882353f),         //电  13
        new Vector4(0.8301887f,0.1683873f,0.4182985f,0.5882353f),         //超能14
        new Vector4(0.509804f,0.7294118f,1,0.5882353f),                   //冰  15
        new Vector4(0,0.04001015f,0.5137255f,0.682353f),                  //龙  16
        new Vector4(0.4056604f,0.3041446f,0.2851104f,0.8313726f),         //恶  17
        new Vector4(0.764151f,0.4649787f,0.6818696f,0.5882353f) };        //妖精18     


    public static Vector4[] TypeColor2 = {
        new Vector4(0,0,0,0.5882353f),                                    //无  00
        new Vector4(0.7176471f, 0.6901961f, 0.6666667f, 0.5882353f),      //普通01
        new Vector4(1, 0.75f, 0.175f, 0.7803922f),     //格斗02
        new Vector4(0.678f,0.643f,0.91f,0.5882353f),            //飞行03
        new Vector4(0.875f,0.385f,0.733f,0.5882353f),        //毒  04
        new Vector4(0.81f,0.702f,0.51f,0.7058824f),          //地面05
        new Vector4(0.68f, 0.54f,0.2636614f,0.702f ),       //岩石06
        new Vector4(0.9f,0.945f,0.506f,0.5882353f),         //虫  07
        new Vector4(0.92f,0.31f,0.43f,0.627451f ),         //幽灵08
        new Vector4(0.765f,0.64f,0.5f,0.53f),                           //钢  09
        new Vector4(1,0.95f,0,0.6862745f),                 //火  10
        new Vector4(0.54f,0.75f,0.8903922f,0.5882353f),         //水  11
        new Vector4(0.69f,0.87f,0.54f,0.5882353f),         //草  12
        new Vector4(0.96f,0.93f,0.63f,0.5882353f),         //电  13
        new Vector4(0.86f,0.50f,0.655f,0.5882353f),         //超能14
        new Vector4(0.495f,0.765f,0.895f,0.5882353f),                   //冰  15
        new Vector4(0.845f,0.553f,0.5137255f,0.682353f),                  //龙  16
        new Vector4(1,0.498f,0.53104f,0.8313726f),         //恶  17
        new Vector4(0.823f,0.87f,0.95f,0.5882353f) };        //妖精18     



    public static Color[] TeraTypeColor = {
            new Vector4(0,0,0,1.0f),                                    //无  00
            new Vector4(1,1, 1, 1.0f),      //普通01
            new Vector4(0.8490566f,0.3308623f, 0.09211465f, 1.0f),     //格斗02
            new Vector4(0.2669989f,0.3516708f,0.754717f,1.0f),            //飞行03
            new Vector4(0.5773619f,0.2232111f,0.8301887f,1.0f),        //毒  04
            new Vector4(0.6226415f,0.4680493f,0.08517268f,1.0f),          //地面05
            new Vector4(0.4528302f,0.4463697f,0.1901032f,1.0f ),       //岩石06
            new Vector4(0.5148496f,0.7735849f,0.4561232f,1.0f),         //虫  07
            new Vector4(0.3214015f,0.1674528f,0.6698113f,1.0f ),         //幽灵08
            new Vector4(0.378471f,0.5036707f,0.5943396f,1.0f),                           //钢  09
            new Vector4(0.7830189f,0.2277878f,0.08495018f,1.0f),                 //火  10
            new Vector4(0.2079032f,0.2384928f,0.6037736f,1.0f),         //水  11
            new Vector4(0.2308206f,0.8584906f,0.3941831f,1.0f),         //草  12
            new Vector4(0.9339623f,0.9234161f,0.4537647f,1.0f),         //电  13
            new Vector4(0.7488047f,0.1703008f,0.8396226f,1.0f),         //超能14
            new Vector4(0,0.7069082f,1,1.0f),                   //冰  15
            new Vector4(0.3939791f,0.1981132f,0.7924528f,1.0f),                  //龙  16
            new Vector4(0.9528302f,0.2651744f,0.2719075f,1.0f),         //恶  17
            new Vector4(0.9433962f,0.1913492f,0.5875216f,1.0f) };        //妖精18     


    public static string[] TypeChineseName = {
        "无","普通","格斗","飞行","毒","地面","岩石","虫","幽灵","钢","火","水","草","电","超能","冰","龙","恶","妖精"};
    }


